Revit 2024 API
Wire.WiringType Property
 The wiring type(arc or chamfer) for the wire.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WiringType WiringType { get; set; }
Visual Basic
Public Property WiringType As WiringType
	Get
	Set
Visual C++
public:
property WiringType WiringType {
	WiringType get ();
	void set (WiringType value);
}
Remarks
 If the WiringType is arc, the shape of the wire depends on the number of points - it may be linear, a circular arc, or a spline.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace